In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.3.1'

In [3]:
emp = pd.read_excel(r'C:\Users\HP\OneDrive\Documents\SENAPATI SIR FSDS NOTE\AGUST MONTH DS NOTE\28- 03_EDA\Rawdata.xlsx')
emp

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [4]:
emp.shape

(6, 6)

In [5]:
emp.ndim

2

In [6]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       4 non-null      object
 3   Location  4 non-null      object
 4   Salary    6 non-null      object
 5   Exp       5 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [7]:
emp.isnull().sum()

Name        0
Domain      0
Age         2
Location    2
Salary      0
Exp         1
dtype: int64

In [8]:
emp.head()

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year

In [9]:
emp.tail()

     Name          Domain     Age   Location   Salary      Exp
1  Teddy^         Testing  45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#     NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics     NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics   67-yr        NaN   30000-  5+ year
5     Kim             NLP    55yr      Delhi  6000^$0      10+

In [10]:
emp['Name']

0      Mike
1    Teddy^
2     Uma#r
3      Jane
4    Uttam*
5       Kim
Name: Name, dtype: object

In [11]:
emp['Name'] = emp['Name'].str.replace(r'\W','',regex = True) # use .replace for remove special cherecter from the name string and W for same also

In [12]:
emp['Name']

0     Mike
1    Teddy
2     Umar
3     Jane
4    Uttam
5      Kim
Name: Name, dtype: object

In [13]:
#emp['Name'] = emp['Name'].str.replace(r'\W','',regex = False)

In [14]:
emp['Name']

0     Mike
1    Teddy
2     Umar
3     Jane
4    Uttam
5      Kim
Name: Name, dtype: object

In [15]:
emp['Domain']

0     Datascience#$
1           Testing
2    Dataanalyst^^#
3       Ana^^lytics
4        Statistics
5               NLP
Name: Domain, dtype: object

In [16]:
emp['Domain'] = emp['Domain'].str.replace(r'\W','',regex= True)

In [17]:
emp['Domain']

0    Datascience
1        Testing
2    Dataanalyst
3      Analytics
4     Statistics
5            NLP
Name: Domain, dtype: object

In [18]:
emp['Location']

0       Mumbai
1    Bangalore
2          NaN
3     Hyderbad
4          NaN
5        Delhi
Name: Location, dtype: object

In [19]:
emp['Location'] = emp['Location'].str.replace(r'\w','',regex=True)

In [20]:
emp['Location']

0
1
2    NaN
3
4    NaN
5
Name: Location, dtype: object

In [21]:
#emp['Location']= emp['Location'].str.replace(r'\W','',regex = False) # W = non word cherecter

In [22]:
emp['Location']

0
1
2    NaN
3
4    NaN
5
Name: Location, dtype: object

In [23]:
emp

    Name       Domain       Age Location   Salary      Exp
0   Mike  Datascience  34 years            5^00#0       2+
1  Teddy      Testing    45' yr           10%%000       <3
2   Umar  Dataanalyst       NaN      NaN  1$5%000   4> yrs
3   Jane    Analytics       NaN            2000^0      NaN
4  Uttam   Statistics     67-yr      NaN   30000-  5+ year
5    Kim          NLP      55yr           6000^$0      10+

In [24]:
emp['Salary']

0     5^00#0
1    10%%000
2    1$5%000
3     2000^0
4     30000-
5    6000^$0
Name: Salary, dtype: object

In [25]:
emp['Salary'] = emp['Salary'].str.replace(r'\w','',regex=True)

In [26]:
emp['Salary']

0    ^#
1    %%
2    $%
3     ^
4     -
5    ^$
Name: Salary, dtype: object

In [27]:
emp['Salary']= emp['Salary'].str.replace(r'\W','',regex = True) # W = non word cherecter

In [28]:
emp['Salary']

0
1
2
3
4
5
Name: Salary, dtype: object

In [29]:
emp['Age']= emp['Age'].str.extract('(\\d+)') # W = non word cherecter

In [30]:
emp['Age']

0     34
1     45
2    NaN
3    NaN
4     67
5     55
Name: Age, dtype: object

In [31]:
emp['Salary']= emp['Salary'].str.extract('(\\d+)') # W = non word cherecter

In [32]:
emp['Salary']

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
Name: Salary, dtype: object

In [33]:
emp

    Name       Domain  Age Location Salary      Exp
0   Mike  Datascience   34             NaN       2+
1  Teddy      Testing   45             NaN       <3
2   Umar  Dataanalyst  NaN      NaN    NaN   4> yrs
3   Jane    Analytics  NaN             NaN      NaN
4  Uttam   Statistics   67      NaN    NaN  5+ year
5    Kim          NLP   55             NaN      10+

In [34]:
emp['Salary']= emp['Salary'].str.replace(r'\W','',regex = True) # W = non word cherecter

In [35]:
emp['Salary']

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
Name: Salary, dtype: object

In [36]:
emp['Exp']= emp['Exp'].str.extract('(\\d+)') # W = non word cherecter

In [37]:
emp['Exp']

0      2
1      3
2      4
3    NaN
4      5
5     10
Name: Exp, dtype: object

In [38]:
emp

    Name       Domain  Age Location Salary  Exp
0   Mike  Datascience   34             NaN    2
1  Teddy      Testing   45             NaN    3
2   Umar  Dataanalyst  NaN      NaN    NaN    4
3   Jane    Analytics  NaN             NaN  NaN
4  Uttam   Statistics   67      NaN    NaN    5
5    Kim          NLP   55             NaN   10

In [39]:
pd.__version__

'2.3.1'

In [40]:
emp = pd.read_excel(r"C:\Users\HP\OneDrive\Documents\SENAPATI SIR FSDS NOTE\AGUST MONTH DS NOTE\28- 03_EDA\Rawdata.xlsx")

In [41]:
emp

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [42]:
emp.shape

(6, 6)

In [43]:
emp.ndim

2

In [44]:
emp.size

36

In [46]:
emp.columns

Index(['Name', 'Domain', 'Age', 'Location', 'Salary', 'Exp'], dtype='object')

In [50]:
emp.head()

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year

In [51]:
emp.tail()

     Name          Domain     Age   Location   Salary      Exp
1  Teddy^         Testing  45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#     NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics     NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics   67-yr        NaN   30000-  5+ year
5     Kim             NLP    55yr      Delhi  6000^$0      10+

In [52]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       4 non-null      object
 3   Location  4 non-null      object
 4   Salary    6 non-null      object
 5   Exp       5 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [53]:
emp.isnull()

    Name  Domain    Age  Location  Salary    Exp
0  False   False  False     False   False  False
1  False   False  False     False   False  False
2  False   False   True      True   False  False
3  False   False   True     False   False   True
4  False   False  False      True   False  False
5  False   False  False     False   False  False

In [54]:
emp.isnull().sum()

Name        0
Domain      0
Age         2
Location    2
Salary      0
Exp         1
dtype: int64

In [55]:
emp

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [56]:
emp['Name']

0      Mike
1    Teddy^
2     Uma#r
3      Jane
4    Uttam*
5       Kim
Name: Name, dtype: object

In [58]:
emp['Name'] = emp['Name'].str.replace(r'\W','',regex=True)

In [59]:
emp['Name']

0     Mike
1    Teddy
2     Umar
3     Jane
4    Uttam
5      Kim
Name: Name, dtype: object

In [60]:
emp['Domain']

0     Datascience#$
1           Testing
2    Dataanalyst^^#
3       Ana^^lytics
4        Statistics
5               NLP
Name: Domain, dtype: object

In [62]:
emp['Domain'] = emp['Domain'].str.replace(r'\W','',regex=True)

In [63]:
emp['Domain']

0    Datascience
1        Testing
2    Dataanalyst
3      Analytics
4     Statistics
5            NLP
Name: Domain, dtype: object

In [64]:
emp

    Name       Domain       Age   Location   Salary      Exp
0   Mike  Datascience  34 years     Mumbai   5^00#0       2+
1  Teddy      Testing    45' yr  Bangalore  10%%000       <3
2   Umar  Dataanalyst       NaN        NaN  1$5%000   4> yrs
3   Jane    Analytics       NaN   Hyderbad   2000^0      NaN
4  Uttam   Statistics     67-yr        NaN   30000-  5+ year
5    Kim          NLP      55yr      Delhi  6000^$0      10+

In [65]:
emp['Location']

0       Mumbai
1    Bangalore
2          NaN
3     Hyderbad
4          NaN
5        Delhi
Name: Location, dtype: object

In [66]:
emp['Location'] = emp['Location'].str.replace(r'\W','',regex= True)

In [67]:
emp['Location']

0       Mumbai
1    Bangalore
2          NaN
3     Hyderbad
4          NaN
5        Delhi
Name: Location, dtype: object

In [68]:
emp['Age']

0    34 years
1      45' yr
2         NaN
3         NaN
4       67-yr
5        55yr
Name: Age, dtype: object

In [69]:
emp['Age'] = emp['Age'].str.replace(r'\W','',regex=True)

In [70]:
emp['Age']

0    34years
1       45yr
2        NaN
3        NaN
4       67yr
5       55yr
Name: Age, dtype: object

In [72]:
emp['Age'] = emp['Age'].str.extract('(\\d+)')

In [73]:
emp['Age']

0     34
1     45
2    NaN
3    NaN
4     67
5     55
Name: Age, dtype: object

In [74]:
emp

    Name       Domain  Age   Location   Salary      Exp
0   Mike  Datascience   34     Mumbai   5^00#0       2+
1  Teddy      Testing   45  Bangalore  10%%000       <3
2   Umar  Dataanalyst  NaN        NaN  1$5%000   4> yrs
3   Jane    Analytics  NaN   Hyderbad   2000^0      NaN
4  Uttam   Statistics   67        NaN   30000-  5+ year
5    Kim          NLP   55      Delhi  6000^$0      10+

In [75]:
emp['Salary']

0     5^00#0
1    10%%000
2    1$5%000
3     2000^0
4     30000-
5    6000^$0
Name: Salary, dtype: object

In [76]:
emp['Salary'] = emp['Salary'].str.replace(r'\W','',regex=True)

In [77]:
emp['Salary']

0     5000
1    10000
2    15000
3    20000
4    30000
5    60000
Name: Salary, dtype: object

In [78]:
emp['Exp']

0         2+
1         <3
2     4> yrs
3        NaN
4    5+ year
5        10+
Name: Exp, dtype: object

In [79]:
emp['Exp'] = emp['Exp'].str.extract('(\\d+)')

In [80]:
emp['Exp']

0      2
1      3
2      4
3    NaN
4      5
5     10
Name: Exp, dtype: object

In [81]:
emp

    Name       Domain  Age   Location Salary  Exp
0   Mike  Datascience   34     Mumbai   5000    2
1  Teddy      Testing   45  Bangalore  10000    3
2   Umar  Dataanalyst  NaN        NaN  15000    4
3   Jane    Analytics  NaN   Hyderbad  20000  NaN
4  Uttam   Statistics   67        NaN  30000    5
5    Kim          NLP   55      Delhi  60000   10

In [82]:
clean_data = emp.copy()

In [83]:
clean_data

    Name       Domain  Age   Location Salary  Exp
0   Mike  Datascience   34     Mumbai   5000    2
1  Teddy      Testing   45  Bangalore  10000    3
2   Umar  Dataanalyst  NaN        NaN  15000    4
3   Jane    Analytics  NaN   Hyderbad  20000  NaN
4  Uttam   Statistics   67        NaN  30000    5
5    Kim          NLP   55      Delhi  60000   10

In [84]:
clean_data.isnull().sum()

Name        0
Domain      0
Age         2
Location    2
Salary      0
Exp         1
dtype: int64

In [85]:
emp.isnull().sum()

Name        0
Domain      0
Age         2
Location    2
Salary      0
Exp         1
dtype: int64

In [86]:
clean_data['Age']

0     34
1     45
2    NaN
3    NaN
4     67
5     55
Name: Age, dtype: object

In [87]:
import numpy as np

In [88]:
clean_data['Age'] = clean_data['Age'].fillna(np.mean(pd.to_numeric(clean_data['Age'] )))

In [89]:
clean_data['Age']

0       34
1       45
2    50.25
3    50.25
4       67
5       55
Name: Age, dtype: object

In [90]:
clean_data['Exp']

0      2
1      3
2      4
3    NaN
4      5
5     10
Name: Exp, dtype: object

In [99]:
clean_data['Exp'] = clean_data['Exp'].fillna(np.mean(pd.to_numeric(clean_data['Exp'])))

In [100]:
clean_data['Exp']

0        2
1        3
2        4
3    50.25
4        5
5       10
Name: Exp, dtype: object

In [101]:
clean_data

    Name       Domain    Age   Location Salary    Exp
0   Mike  Datascience     34     Mumbai   5000      2
1  Teddy      Testing     45  Bangalore  10000      3
2   Umar  Dataanalyst  50.25  Bangalore  15000      4
3   Jane    Analytics  50.25   Hyderbad  20000  50.25
4  Uttam   Statistics     67  Bangalore  30000      5
5    Kim          NLP     55      Delhi  60000     10

In [102]:
clean_data['Location'] = clean_data['Location'].fillna(clean_data['Location'].mode()[0])

In [103]:
clean_data['Location']

0       Mumbai
1    Bangalore
2    Bangalore
3     Hyderbad
4    Bangalore
5        Delhi
Name: Location, dtype: object

In [104]:
clean_data

    Name       Domain    Age   Location Salary    Exp
0   Mike  Datascience     34     Mumbai   5000      2
1  Teddy      Testing     45  Bangalore  10000      3
2   Umar  Dataanalyst  50.25  Bangalore  15000      4
3   Jane    Analytics  50.25   Hyderbad  20000  50.25
4  Uttam   Statistics     67  Bangalore  30000      5
5    Kim          NLP     55      Delhi  60000     10

In [105]:
clean_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       6 non-null      object
 3   Location  6 non-null      object
 4   Salary    6 non-null      object
 5   Exp       6 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [106]:
clean_data.isnull().sum()

Name        0
Domain      0
Age         0
Location    0
Salary      0
Exp         0
dtype: int64

In [107]:
clean_data['Age']

0       34
1       45
2    50.25
3    50.25
4       67
5       55
Name: Age, dtype: object

In [108]:
clean_data['Age'] = clean_data['Age'].astype(int)

In [109]:
clean_data['Age']

0    34
1    45
2    50
3    50
4    67
5    55
Name: Age, dtype: int64

In [110]:
clean_data['Salary']

0     5000
1    10000
2    15000
3    20000
4    30000
5    60000
Name: Salary, dtype: object

In [112]:
clean_data['Salary'] = clean_data['Salary'].astype(int)

In [113]:
clean_data['Salary']

0     5000
1    10000
2    15000
3    20000
4    30000
5    60000
Name: Salary, dtype: int64

In [114]:
clean_data['Name'] = clean_data['Name'] .astype('category')

In [116]:
clean_data['Name']

0     Mike
1    Teddy
2     Umar
3     Jane
4    Uttam
5      Kim
Name: Name, dtype: category
Categories (6, object): ['Jane', 'Kim', 'Mike', 'Teddy', 'Umar', 'Uttam']

In [117]:
clean_data

    Name       Domain  Age   Location  Salary    Exp
0   Mike  Datascience   34     Mumbai    5000      2
1  Teddy      Testing   45  Bangalore   10000      3
2   Umar  Dataanalyst   50  Bangalore   15000      4
3   Jane    Analytics   50   Hyderbad   20000  50.25
4  Uttam   Statistics   67  Bangalore   30000      5
5    Kim          NLP   55      Delhi   60000     10

In [118]:
clean_data['Domain'] = clean_data['Domain'] .astype('category')

In [119]:
clean_data['Domain']

0    Datascience
1        Testing
2    Dataanalyst
3      Analytics
4     Statistics
5            NLP
Name: Domain, dtype: category
Categories (6, object): ['Analytics', 'Dataanalyst', 'Datascience', 'NLP', 'Statistics', 'Testing']

In [120]:
clean_data['Location'] = clean_data['Location'] .astype('category')

In [121]:
clean_data['Location']

0       Mumbai
1    Bangalore
2    Bangalore
3     Hyderbad
4    Bangalore
5        Delhi
Name: Location, dtype: category
Categories (4, object): ['Bangalore', 'Delhi', 'Hyderbad', 'Mumbai']

In [122]:
clean_data['Age'] = clean_data['Age'] .astype('category')

In [123]:
clean_data['Age']

0    34
1    45
2    50
3    50
4    67
5    55
Name: Age, dtype: category
Categories (5, int64): [34, 45, 50, 55, 67]

In [126]:
clean_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      category
 1   Domain    6 non-null      category
 2   Age       6 non-null      category
 3   Location  6 non-null      category
 4   Salary    6 non-null      int64
 5   Exp       6 non-null      object
dtypes: category(4), int64(1), object(1)
memory usage: 1.1+ KB

In [127]:
clean_data.to_csv('clean_data.csv')

In [128]:
import os

In [129]:
os.getcwd()

'C:\\Users\\HP\\Untitled Folder 1'